[
  {
    "title": "That's it",
    "date": "01-09-2015",
    "content": "&emsp;Sometimes the things you love the most disappear suddenly. When my father died it was like nothing really changed for me, and that continues to be true. All I really have is the knowledge that he died, and that hurts for some reason even though I don't want it to. You may recognize today as the 2nd anniversary of his death, you may not. I hardly even remembered. When my dad died his life insurance paid out so we weren't really in a lot of trouble. The funeral was surprisingly simple. My cousin handled most everything anyway. Mostly I stared at a screen up till the funeral. I put out a lot of posts that month about things that didn't matter, and watched a lot of movies and played a lot of games and that was it. <br>\r\n<br>\r\n&emsp;I remember being really hungry during my dad's funeral. One of my earliest memories is of a funeral. My grandma's. I remember my aunt and my mother bound to her casket by their tears, and I started to cry too. I think I may have been about 2. My brother did not even exist yet. I started crying for some reason I couldn't understand, maybe it was my first moment of conscious empathy even if I didn't know what I was feeling. My cousin came to comfort me. He's only 7 years older than me so about 9, but he seemed so much larger than life at that moment, and has my entire life. He asked me if I was hungry. I don't think I was able to eke out a coherent response, but he brought me over to a table with bread and I took a bite, and it was soft and milky and so tenderly sweet and I stopped crying. I was hungry.\r\n<br>\r\n<br>\r\n&emsp;So would it be weird to describe my father as something, somebody that I loved most? Almost nothing’s changed. When I went away for college, I wouldn’t speak to my father for months at a time. When they lived separately I wasn’t allowed to speak to him until summer came, and when they lived together I felt I could never utter a word that came purely out of love and not some primitive imitation of what I’ve seen on screen. My mother is and has been lonely for 20 years. My brother is grieving but he will overcome. I will continue to exist until I don’t. For now I sit in a room of stuff I’ve accumulated over the years of things I love. Hundreds, probably thousands of dollars of stuff. None of them are my father, none of them are my mother. Sometimes I worry that I won’t cry when my mother dies.\r\n<br>\r\n<br>\r\n&emsp;I’ve heard people say the phrase: child of divorce and I do feel bad for them but I say “good for them!” because in the end their parents are still people who just need to go their separate ways now, but I can’t because how perverse would it be to respond with “I am a child of marriage”? As if I were just rubbing my completely solid and foundational sound family in their face, though it’s not as if I were saying “I am a child of love!” I’ve met people who are children of love, I’ve loved people who are children of love where marriage is just a side benefit of love, due in part to some perverted form of jealousy perhaps. And it’s easy to admit I am jealous because that’s just the truth and there are few things I long for more, because sometimes I really just hate feeling like a child of marriage. \r\n<br><br>\r\nI won’t be coming back. Thank you for the years.\r\n"
  },
  {
    "title": "",
    "date": "2014-05-07",
    "content": "I graduate soon. I hate ceremonies, always have. My mother insists that I have one. I don’t want to."
  },
  {
    "title": "",
    "date": "2014-01-26",
    "content": ["I still went back to school. I’m not sure I wanted to but my mom sent me off. She said she was better now. I remember her saying that once before. Missed a couple days of classes but it’s not so bad."]
  },
  {
    "title": "",
    "date": "2014-01-10",
    "content": ["Yesterday my dad died. They said he had a heart attack. But he was a perfectly healthy man. He didn’t eat like crap and he tried not to overwork himself and he would always do things with a smile on his face and he died of a heart attack anyways. I couldn’t sleep last night. Right now I can feel my eyes burning into my skull as if they were so dry that they burned the tears on contact. Mom couldn’t do anything tonight, but she still has to eat. So I made chili. I like to make chilli you just throw a bunch of random stuff into a bot with tomato paste and random spices and it pretty much just works. You get like potatoes and some ground beef and onions. Cutting onions suck. The juices hurt your eyes like hell. I didn’t cry when i heard the news, but when I cut those onions they bled tears and they didn’t stop for hours."]
  }
,
  {
    "title": "",
    "date": "2013-11-28",
    "content": ["An American holiday my family never really celebrated was Thanksgiving. We put on hotpot for thanksgiving which is just a big pot of boiling water and broth that we throw meat and veggies into with a portable. I’ve never had a turkey for Thanksgiving before, but I think I’m in love with thanksgiving food? Stuffing is just incredible I feel betrayed that this stuff has been kept from me my entire life. Cranberry sauce? Holy fuck."]
  }
,
  {
    "title": "",
    "date": "2013-04-29",
    "content": ["I was playing tennis at the gym with my friends today and for some reason I got so upset I broke my racket. I slammed it against the ground as hard as I could, once. And then again and again and again until it lost its purpose, it was useless now as a racket. And I chose to do that, because after the first hit there was a second and a third and a fourth and a fifth and I stepped outside into the cool night air and found I wanted to call my mom for some reason. Not really for some reason I suppose. I feel that way a lot I think but I never do. I dread those calls. Calls I used to be denied are now a forced part of my life, one week at a time. So I’m confused why I would want to call her. Not once in my life have I confided in my mother anything of importance to me and I can’t for the life of me understand why I feel this way when it’s there’s just me to deal with it. The reason was very stupid but they got in my head, because that’s what these idiots do and I hated that feeling so much, not the way they made me feel, but the way I felt about how I reacted. Like all I were was a vessel for a body I have no control over. We laughed about it when I came back in, it was funny I guess. I’m glad we could laugh about it."]
  }
,
  {
    "title": "",
    "date": "2013-01-27",
    "content": ["I never realized until I started university just how much DAMN MATH I WOULD BE DOING. Like it’s fine I can grasp it, dare I say I might even be good at it! But still it’s no fun, except for when things click. Like that is pretty much the only time that calculus is fun. All the other math classes are interesting at the very least, graph theory, and probability are probably some of my favorite classes which just directly contradicts what I said earlier but doesn’t mean I particularly enjoy sitting in lecture for two hours at a time watching some dude write numbers and letters on a board. Math is interesting but I wouldn’t dedicate my life to it and recently we’ve been working on a project, me and Joel. I think it’s gonna be great, he’s always so supportive. It’s nice."]
  }
,
  {
    "title": "",
    "date": "2012-11-01",
    "content": ["Working at Geico right now! Writing code and stuff! I love being employed! At least there’s free food for lunch, and Maryland is nice too."]
  }
,
  {
    "title": "",
    "date": "2012-03-19",
    "content": ["Nothing significant really happened. I’ve never found journaling to be that interesting nor am I good at consistency. It’s the one consistent thing about me really. But today something interesting did happen, my dad called me. Usually it’s just my mom calling which she does about once a week. She usually asks me about how my classes are going and then we hang up. It’s not very interesting nor do I really enjoy our calls or hearing her voice."]
  }
,
  {
    "title": "",
    "date": "2011-08-20",
    "content": "GOD ITS HOT IN THE SUMMER."
  }
,
  {
    "title": "",
    "date": "2011-06-15",
    "content": ["Entered into a game jam for the first time! Our game was shit but it was cool just to do something like that and honestly I had no idea just how much work went into it so my friends basically had to drag my bum ass over the finish line while I just worked on some art LOL."]
  }
,
  {
    "title": "",
    "date": "2011-03-01",
    "content": ["Actually college isn’t that bad. I enjoy the work I’m doing and it’s certainly much more interesting than high school."]
  }
,
  {
    "title": "",
    "date": "2011-01-17",
    "content": ["First birthday I don’t spend at home! What should I do? Nothing! Birthdays are just so meh like what do you mean I’m just older now? This shit sucks."]
  }
,
  {
    "title": "",
    "date": "2011-01-10",
    "content": ["Just had a thought. It’s kind of weird,but for a little bit of time I couldn’t sleep alone in the room my mom moved me to when I was much younger. I shared a bed with my brother for pretty much all of my childhood and found out that I could only sleep knowing that my brother was in the same room as me. Pretty much everyday for that week I would wait up for my dad to return home from work at around 12am and once I heard the sound of his footsteps coming out the stairs I would greet him crying and he would take me to bed and tuck me in. My mom took to sleeping in that room herself soon after. I have a roommate now too, and I think I prefer it to a singles room, being in a room by yourself is kind of depressing, and as long as we’re sitting in that room together we’re not alone. I can imagine it would be miserable in a room by yourself when you don’t make an effort to go out much like me. I couldn’t imagine the feeling of being all alone in a huge house in the middle of the suburbs, your children 1000 miles away and your wife pulling herself out of orbit. It scares me. It terrifies me."]
  }
,
  {
    "title": "",
    "date": "2011-01-01",
    "content": ["The ball drop is so boring. I genuinely don’t get this I’m writing this day of its like 12:10 right now and I’m just sitting here on a phone call with Joel and I’m like what is the point of this ball?"]
  }
,
  {
    "title": "",
    "date": "2010-12-25",
    "content": ["Christmas! Deciding which Christmas presents to buy is a hell of its own. Really lovely to just receive money though, that’s real thoughtful of you wow thanks mom money is so me! Money again!"]
  }
,
  {
    "title": "",
    "date": "2010-12-03",
    "content": ["Wow it gets cold in Rochester. It was just 52 degrees yesterday, well now it’s still 32 at least but I’m not looking forward to the coming days."]
  },
  {
    "title":"",
    "date":"2010-11-01",
    "content":  ["So movie review time! We spent most of Halloween watching movies and then went out on the town for some light trick or treating! I was a conehead zombie! ANYWAYS ALL OF THE MOVIES SUCKED LOL. Well that’s an exaggeration like 28 weeks later which I accidentally called 28 years later by accident I wonder if they’ll make a sequel. But anyways I digress 28 weeks kind of sucked, 1000 corpses was interesting… to say the least, unfortunately not the greatest film of all time so unfortunately my friend is no longer with us and zombieland was awesome actually super funny and I’m now in love with Emma Stone. Candy haul was shit though Rochester might be the worst city in New York."]
  }
,
  {
    "title": "",
    "date": "2010-10-30",
    "content": ["Just about Halloween, we picked up some movies from a local video rental store. Forgot the name, called video classic or something it was in a really funnily named place like pickle or something I love pickles god. The avenue is named pickles. Like the location of it the store is called video classic or classic video or something. We got the Zombieland with the guy from the social network we saw that one in theaters when it came out, we got the 28 years later, and something Joel says is an “absolute cult classic super epic 420 blaze it” super spectacular movie experience called House of a 1000 corpses, so if this is just not the greatest horror film of all time I might genuinely have to kill him and he agreed so."]
  }
,
  {
    "title": "",
    "date": "2010-09-10",
    "content": "College is just more school. Bummer."
  }
,
  {
    "title": "",
    "date": "2010-07-07",
    "content": ["Wow I totally forgot about this thing. Been a total whirlwind of a year kinda. I uh was in a relationship for a little bit? It wasn’t that serious oh yeah I’m currently 18 years of age? Kind of old no? God I feel old sometimes. Anyways sometimes the internet is kind of weird. Before mom would call home from work and I’d pick up the phone attached to the wall and she’d tell me that she would be home late and that I would have to pick some stuff up from the grocery store BUT I DIGRESS. Saw it on a and that word was in the paper means to get back to the main point or something like that and I don’t even have to look anything up in a big-ass dictionary or go on a computer or anything it’s just on my phone I can just google it? Insane. My digression seems to have been faulty, but I really truly will get back to the point which is that I have a phone and it has the ability to invisibly connect me to people across the entire country!? And I still can’t stay connected? Why is it so hard to talk to somebody you desperately want to talk to? Maybe if we were more serious it wouldn’t have been so hard to keep up, but we we never got to that point when we still went to the same school, and we would never have been able to a million miles apart. It’s kind of my fault really, both for the messages, and for going so far away. I needed to go away though. I really did I needed to try."]
  }
,
  {
    "title": "Hello World!",
    "date": "2009-01-17",
    "content": "For my 17th, my dad got me my own desktop! I remember I had a shitty little blog\/journal thing many, many years back, so I figured, why not? Also found the exact blog, or more of a journal really, on a floppy in the basement Expect posts not frequently at all and only when I remember this exists!<br><br>"
  }
]
